tap "anchore/grype"
tap "derailed/k9s"
tap "siderolabs/tap"
# Code searching, linting, rewriting
brew "ast-grep"
# Prevent cloud misconfigurations during build-time for IaC tools
brew "checkov"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Command-line tool to manage cert-manager
brew "cmctl"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Vulnerability scanner for container images and filesystems
brew "grype"
# Kubernetes package manager
brew "helm"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes testing according to Hardening Guidance by NSA and CISA
brew "kubescape"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Graphical command-line client for SSH
brew "sshs"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "siderolabs/tap/talosctl"
